Разделение Сетей
Lan 1: 192.168.1.0 255.255.255.0
Lan 2: 192.168.2.0 255.255.255.0
Lan 3: 192.168.3.0 255.255.255.0

R1#config t
R1(config)#interface FastEthernet 0/0           
R1(config-if)#ip address 192.168.1.3 255.255.255.0
R1(config-if)#interface FastEthernet 1/0          
R1(config-if)#ip address 192.168.3.3 255.255.255.0
R1(config-if)#interface FastEthernet 2/0          
R1(config-if)#ip address 192.168.2.3 255.255.255.0

R2#config t      
R2(config)#interface FastEthernet 0/0
R2(config-if)#ip address 192.168.3.2 255.255.255.0
R2#wr mem
R2#config
R2(config)#ip dhcp pool LAN1_POOL
R2(dhcp-config)#network 192.168.1.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.1.3
R2(dhcp-config)#dns-server 192.168.1.3
R2(dhcp-config)#lease 10
R2#config t
R2(config)#ip dhcp pool LAN2_POOL              
R2(dhcp-config)#network 192.168.2.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.2.3       
R2(dhcp-config)#dns-server 192.168.2.3           
R2(dhcp-config)#lease 10
R2#config t
R2(config)#ip dhcp excluded-address 192.168.1.3
R2(config)#ip dhcp excluded-address 192.168.2.3
R2#config t
R2(config)#ip route 192.168.1.0 255.255.255.0 192.168.3.3
R2(config)#ip route 192.168.2.0 255.255.255.0 192.168.3.3
R1#config t                                       
R1(config)#ip route 192.168.3.0 255.255.255.0 192.168.3.2 

R2#sh ip interface brief 
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            192.168.3.2     YES NVRAM  administratively down down    
R2#conf t              
R2(config)#interface FastEthernet 0/0
R2(config-if)#no shutdown

R2#show ip route         
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

S    192.168.1.0/24 [1/0] via 192.168.3.3
S    192.168.2.0/24 [1/0] via 192.168.3.3
C    192.168.3.0/24 is directly connected, FastEthernet0/0

R1#ping 192.168.3.2
R1#conf t
R1(config)#interface FastEthernet 0/0
R1(config-if)#ip helper-address 192.168.3.2
R1(config-if)#interface FastEthernet 2/0   
R1(config-if)#ip helper-address 192.168.3.2

PC1> ip dhcp
DDORA IP 192.168.1.1/24 GW 192.168.1.3

PC1> show ip

NAME        : PC1[1]
IP/MASK     : 192.168.1.1/24
GATEWAY     : 192.168.1.3
DNS         : 192.168.1.3  
DHCP SERVER : 192.168.3.2
DHCP LEASE  : 863988, 864000/432000/756000
MAC         : 00:50:79:66:68:00
LPORT       : 20000
RHOST:PORT  : 127.0.0.1:20001
MTU         : 1500

PC1> ping 192.168.1.2
84 bytes from 192.168.1.2 icmp_seq=1 ttl=64 time=6.277 ms

PC1> ping 192.168.2.2
84 bytes from 192.168.2.2 icmp_seq=1 ttl=63 time=34.279 ms

PC1> ping 192.168.2.1
84 bytes from 192.168.2.1 icmp_seq=1 ttl=63 time=26.665 ms

PC3> ping 192.168.1.1
84 bytes from 192.168.1.1 icmp_seq=1 ttl=63 time=30.187 ms

PC3> ping 192.168.1.2
84 bytes from 192.168.1.2 icmp_seq=1 ttl=63 time=25.354 ms

PC3> ping 192.168.2.2
84 bytes from 192.168.2.2 icmp_seq=1 ttl=64 time=6.205 ms